Tekla.Structures.Model.RebarStrand
The RebarStrand class represents prestressed strands for concrete parts.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
using System;
public class Example
{
public void Example1()
{
Beam Beam = new Beam(new Point(5000, 14000, 0), new Point(6000, 14000, 0));
Beam.Profile.ProfileString = "250*250";
Beam.Material.MaterialString = "K40-1";
Beam.Finish = "PAINT";
Beam.Insert();
double MinimumX = Beam.GetSolid().MinimumPoint.X;
double MinimumY = Beam.GetSolid().MinimumPoint.Y;
double MinimumZ = Beam.GetSolid().MinimumPoint.Z;
double MaximumX = Beam.GetSolid().MaximumPoint.X;
double MaximumY = Beam.GetSolid().MaximumPoint.Y;
double MaximumZ = Beam.GetSolid().MaximumPoint.Z;
Polygon Polygon1 = new Polygon();
Polygon1.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
Polygon1.Points.Add(new Point(MinimumX, MaximumY, MaximumZ));
Polygon1.Points.Add(new Point(MinimumX, MinimumY, MaximumZ));
Polygon1.Points.Add(new Point(MinimumX, MinimumY, MinimumZ));
Polygon1.Points.Add(new Point(MinimumX, MaximumY, MinimumZ));
RebarStrand RebarStrand = new RebarStrand();
RebarStrand.Patterns.Add(Polygon1);
RebarStrand.StartPoint = new Point(MinimumX, MinimumY, MinimumZ);
RebarStrand.EndPoint = new Point(MaximumX, MinimumY, MinimumZ);
RebarStrand.Father = Beam;
RebarStrand.Name = "Strand Test 1";
RebarStrand.Class = 3;
RebarStrand.Size = "10";
RebarStrand.NumberingSeries.StartNumber = 0;
RebarStrand.NumberingSeries.Prefix = "STRAND1";
RebarStrand.Grade = "B500K";
RebarStrand.RadiusValues.Add(30.0);
RebarStrand.PullPerStrand = 8000.0;
StrandUnbondingData Unbonding = new StrandUnbondingData();
Unbonding.FromEnd = 20;
Unbonding.FromStart = 20;
Unbonding.MiddleToEnd = 30;
Unbonding.MiddleToStart = 30;
Unbonding.StrandIndex = 1;
RebarStrand.Unbondings.Add(Unbonding);
StrandUnbondingData Unbonding2 = new StrandUnbondingData();
Unbonding2.FromEnd = 40;
Unbonding2.FromStart = 40;
Unbonding2.MiddleToEnd = 15;
Unbonding2.MiddleToStart = 15;
Unbonding2.StrandIndex = 2;
RebarStrand.Unbondings.Add(Unbonding2);
if(!RebarStrand.Insert())
Console.WriteLine("Insert failed!");
}
}

Tekla.Structures.Model.RebarStrand.Size
The size of the reinforcement.

Tekla.Structures.Model.RebarStrand.PullPerStrand
The pull per strand (N).

Tekla.Structures.Model.RebarStrand.Patterns
An array list of polygons that represents the patterns of the rebar strand.
Give the strand positions in the same order as for the first pattern.
The maximum number of patterns is 20.

Tekla.Structures.Model.RebarStrand.Unbondings
An array list of StrandUnbondingData items.

Tekla.Structures.Model.RebarStrand.StartPoint
The start point of the single strand (the start point and end point define the length of the strand).

Tekla.Structures.Model.RebarStrand.EndPoint
The end point of the single strand (the start point and end point define the length of the strand).

Tekla.Structures.Model.RebarStrand.OnPlaneOffsets
Not supported.

Tekla.Structures.Model.RebarStrand.#ctor
Initializes a new rebar strand instance with empty attributes.

Tekla.Structures.Model.RebarStrand.Insert
Inserts the strand into the model database. All the attributes must be set.
Returns: True on success.

Tekla.Structures.Model.RebarStrand.Select
Selects the strand from the model database. The reinforcement identifier must be set.
Returns: True on success.

Tekla.Structures.Model.RebarStrand.Modify
Modifies the existing strand in the model database to match the current one.
Returns: True on success.

Tekla.Structures.Model.RebarStrand.Delete
Deletes the strand instance with the given identifier from the model database.
Returns: True on success.